In [7]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import tensorflow as tf

In [17]:
train_data = pd.read_csv('train.csv')

In [55]:
train_data.head()
train_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [36]:
x_data = train_data.drop(['PassengerId','Survived','Ticket'],axis=1)

In [62]:
# Check column with null values
x_data.isnull().any()

Pclass      False
Name        False
Sex         False
Age          True
SibSp       False
Parch       False
Fare        False
Cabin        True
Embarked     True
dtype: bool

In [70]:
(x_data == 0).any()

Pclass      False
Name        False
Sex         False
Age         False
SibSp        True
Parch        True
Fare         True
Cabin       False
Embarked    False
dtype: bool

In [88]:
# Check number of fare with 0 value
(x_data[['Fare']] == 0).sum()

Fare    15
dtype: int64

In [89]:
# Check age with NaN value
x_data[['Age']].isnull().sum()

Age    177
dtype: int64

In [82]:
# Display & identify such rows
x_data.loc[x_data['Fare'] == 0]

,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Cabin,Embarked
179,3,"Leonard, Mr. Lionel",male,36.0,0,0,0.0,NaN,S
263,1,"Harrison, Mr. William",male,40.0,0,0,0.0,B94,S
271,3,"Tornquist, Mr. William Henry",male,25.0,0,0,0.0,NaN,S
277,2,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,0.0,NaN,S
302,3,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,0.0,NaN,S
413,2,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,0.0,NaN,S
466,2,"Campbell, Mr. William",male,NaN,0,0,0.0,NaN,S
481,2,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,0.0,NaN,S
597,3,"Johnson, Mr. Alfred",male,49.0,0,0,0.0,NaN,S
633,1,"Parr, Mr. William Henry Marsh",male,NaN,0,0,0.0,NaN,S
674,2,"Watson, Mr. Ennis Hastings",male,NaN,0,0,0.0,NaN,S
732,2,"Knight, Mr. Robert J",male,NaN,0,0,0.0,NaN,S
806,1,"Andrews, Mr. Thomas Jr",male,39.0,0,0,0.0,A36,S
815,1,"Fry, Mr. Richard",male,NaN,0,0,0.0,B102,S
822,1,"Reuchlin, Jonkheer. John George",male,38.0,0,0,0.0,NaN,S

In [58]:
# Check number of null values in those columns
x_data[['Age','Cabin','Embarked']].isnull().sum()

Age         177
Cabin       687
Embarked      2
dtype: int64

In [21]:
y_true = train_data['Survived']

In [43]:
pclass = tf.feature_column.numeric_column('Pclass')
age = tf.feature_column.numeric_column('Age')
sibsp = tf.feature_column.numeric_column('SibSp')
parch = tf.feature_column.numeric_column('Parch')
fare = tf.feature_column.numeric_column('Fare')
embarked = tf.feature_column.categorical_column_with_hash_bucket('Embarked',hash_bucket_size=10)
sex = tf.feature_column.categorical_column_with_vocabulary_list('Sex',['male','female'])